In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.1-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\domain\desktop\new folder\depi_amit_ai_bns3\.env\lib\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\domain\desktop\new folder\depi_amit_ai_bns3\.env\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\domain\desktop\new folder\depi_amit_ai_bns3\.env\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.1-cp312-cp312-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
    --------------------------------------- 0.3/11.0 MB ? eta -:--:--
   ---- ----------------------------------- 1.3/11.0 MB 3.5 MB/s eta 0:00:03
   ------- -------------------------------- 2.1/11.0 MB 3.6 MB/s eta 0:00:03
   ---------- ----------------------------- 2.9/11.0 MB 3.6 MB/s eta 0:00:03
   ------------- -------------------------- 3.7/11.0 MB 3.6 MB/s eta 0:00:03
   --------------- ------------------------ 4.2/11.0 MB 3.2 MB/s eta 0:00:03
   -------------------- ------------------- 5.5/11.0 MB 3.5 MB/s eta 0:00:02
   ---------------------- ----------------- 6.3/11.0 MB 3.6 MB/s eta 0:00:02
   ------------------------- -------------- 7.1/11.0 MB 3.6 MB/s eta 0:00:02
   ----------------------------- ---------- 8.1/11.0 MB 3.5 MB/s eta 0:00:01
   -------------------------------- ------- 8.9/11.0 MB 3.5 MB/s eta 0:00:01
   ----------------------------------- ---- 9.7/11.0 MB 3.6 MB/s eta 0:00:01
   -------------------------------------- - 10.5/11.0 MB 3.6 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 3.5 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.1 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd

In [8]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
s = pd.Series([1,2,3,4], index = ['A' , 'B','C','D'])
s

A    1
B    2
C    3
D    4
dtype: int64

In [63]:
data = [[1,444,'renad'],
        [2,555,'ahmed'],
        [3,666,'renad'],
        [4,777,'ahmed']

]

df = pd.DataFrame(data, columns = ['index','std-ID','Name'])
df

   index  std-ID   Name
0      1     444  renad
1      2     555  ahmed
2      3     666  renad
3      4     777  ahmed

In [66]:
data = {'index' : [1,444,'mona'],
       'std_ID' : [2,555,'ahmed'],
        
}

df = pd.DataFrame(data)
df

  index std_ID
0     1      2
1   444    555
2  mona  ahmed

In [24]:
data = df = pd.DataFrame([[1,444,'mona'],
        [2,555,'ahmed'],
        [3,666,'renad'],
        [4,777,'habiba']

])

# display(df)
# cols = ['A','B','C']
# df.columns = cols
idx = ['row_1','row_2','row_3','row_4']
df.index = idx
display(df)

       0    1       2
row_1  1  444    mona
row_2  2  555   ahmed
row_3  3  666   renad
row_4  4  777  habiba

In [67]:

data = df = pd.DataFrame([[1,444,'mona'],
        [2,555,'ahmed'],
        [3,666,'renad'],
        [4,777,'habiba']

])

df = pd.DataFrame(data)
df

   0    1       2
0  1  444    mona
1  2  555   ahmed
2  3  666   renad
3  4  777  habiba

In [30]:
df.dtypes

0     int64
1     int64
2    object
dtype: object

In [34]:
df[2].dtype

dtype('O')

In [36]:
df[1] = df[1].astype('category')
df.dtypes

0       int64
1    category
2      object
dtype: object

In [39]:
cols = [0,1 , 2]
df[cols] = df[cols].astype('category')
df.dtypes

0    category
1    category
2    category
dtype: object

In [42]:
s = pd.Series([1,2,3], index = ['Index' , 'Std_ID','Name'])
s

Index     1
Std_ID    2
Name      3
dtype: int64

In [43]:
df['Index'] = df[0].astype('int')
df.dtypes

0           int64
1        category
2        category
Index       int64
dtype: object

In [46]:
df.head()

   0    1       2  Index
0  1  444    mona      1
1  2  555   ahmed      2
2  3  666   renad      3
3  4  777  habiba      4

In [53]:
df.tail()

   0    1       2  Index
0  1  444    mona      1
1  2  555   ahmed      2
2  3  666   renad      3
3  4  777  habiba      4

In [54]:
df.describe()

              0     Index
count  4.000000  4.000000
mean   2.500000  2.500000
std    1.290994  1.290994
min    1.000000  1.000000
25%    1.750000  1.750000
50%    2.500000  2.500000
75%    3.250000  3.250000
max    4.000000  4.000000

In [52]:


df.describe(include = int)

              0     Index
count  4.000000  4.000000
mean   2.500000  2.500000
std    1.290994  1.290994
min    1.000000  1.000000
25%    1.750000  1.750000
50%    2.500000  2.500000
75%    3.250000  3.250000
max    4.000000  4.000000

In [55]:
df.columns

Index([0, 1, 2, 'Index'], dtype='object')

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      int64
 1   1       4 non-null      category
 2   2       4 non-null      category
 3   Index   4 non-null      int64
dtypes: category(2), int64(2)
memory usage: 612.0 bytes

In [71]:
df[2].unique()

array(['mona', 'ahmed', 'renad', 'habiba'], dtype=object)

In [72]:
df[1].max()

np.int64(777)

In [85]:

data = df = pd.DataFrame([[1,1,'renad'],
        [2,3,'ahmed'],
        [3,5,'renad'],
        [4,100,'ahmed']

])

df = pd.DataFrame(data)
df

   0    1      2
0  1    1  renad
1  2    3  ahmed
2  3    5  renad
3  4  100  ahmed

In [80]:
df[1].idxmax()

3

In [81]:
df[1].max()

np.int64(100)

In [82]:
df[1].idxmin()

0

In [86]:
df[2].value_counts()

2
renad    2
ahmed    2
Name: count, dtype: int64

In [87]:
df[1].sum()

np.int64(109)

In [88]:
df.max()

0        4
1      100
2    renad
dtype: object

In [90]:
df.values

array([[1, 1, 'renad'],
       [2, 3, 'ahmed'],
       [3, 5, 'renad'],
       [4, 100, 'ahmed']], dtype=object)

In [92]:
df.replace(1,"ahmed")

       0      1      2
0  ahmed  ahmed  renad
1      2      3  ahmed
2      3      5  renad
3      4    100  ahmed

In [94]:
df.replace({4 : "Amir"})

      0    1      2
0     1    1  renad
1     2    3  ahmed
2     3    5  renad
3  Amir  100  ahmed

In [96]:
df.iloc[2,1]

np.int64(5)

In [97]:
df.1.iloc[0:2]

SyntaxError: invalid syntax (1830870142.py, line 1)

In [108]:
x = df.iloc[:,:-1]
x

   0    1
0  1    1
1  2    3
2  3    5
3  4  100

In [113]:
new_col = df[0] + df[1]
new_col

0      2
1      5
2      8
3    104
dtype: int64

In [ ]:
df.insert(3, 'new_col',new_col)

In [115]:
x = df.iloc[:,:]
x

   0    1      2  new_col
0  1    1  renad        2
1  2    3  ahmed        5
2  3    5  renad        8
3  4  100  ahmed      104

In [116]:
df.drop('new_col', axis = 1)

   0    1      2
0  1    1  renad
1  2    3  ahmed
2  3    5  renad
3  4  100  ahmed

In [126]:
new_row = {0 : 5}
df.append(new_row)

AttributeError: 'DataFrame' object has no attribute 'append'